/**
* @author luzx
* @desc:  Wallet V5.7
*/
	
define([], function () {
    var MESSAGE = {
        //message
        101: '设置支付密码成功您已完成设备安全认证',
        102: '验证码已发送，请注意查收您的手机短信',
        103: '验证码已发送，请进入您的邮箱获取',
        104: '找回支付密码成功',
        105: "由于账户安全或政策原因，您的账户已冻结，现金余额及礼品卡暂时无法使用。",
        106: "不可用余额是指用户办理一些特殊业务时，账户中暂时不能使用的那部分资金",
        107: '修改安全验证手机成功',
        108: '绑定安全验证手机成功',
        109: '为了您的账户资金安全，只能够提现至账户实名信息对应的银行卡。<br/><br/>如有任何疑问，请致电<a class="underline J_CtripHelp">携程客服</a>。',
        110: '为了你的账户资金安全，请使用本人银行卡，姓名、证件信息将作为账户的实名信息，提交后无法更改。',
        111: '您已成功删除该常用卡记录',
        112: '支付密码在账户余额/礼品卡付款或修改钱包账户信息时输入，用户保护账户资金安全',
        113: '已成功将安全验证手机更换为<br/>{1}',
        114: '您的账户处于冻结状态，目前无法操作，如需帮助请联系携程客服。',
        115: '本次充值失败，银行已扣款金额我们尽快退回您的银行账户。',
        116: '确认关闭指纹支付？',
        117: '已成功开通指纹支付！',
        118: '请验证您的指纹，以完成开通',
        119: '已关闭指纹支付！',
        120: '成功设置账号支付密码和手机',
        121: '您尚未设置支付密码，请先进行设置。',
        122: '请验证您的指纹，以完成身份验证',
        123: '网络系统异常，请稍后重试',

        //error
        300: '其他错误',
        301: '登录密码错误，请重新输入',
        302: '设置支付密码失败，请重试',
        303: '验证码发送失败，请重试',
        304: '很抱歉，您的验证次数已达上限，请明天再试！',
        305: '请输入登入密码',
        306: '请输入支付密码',
        307: '支付密码不能与登录密码相同',
        308: '您设置的支付密码安全性过低，请重新设置',
        309: '请再次输入支付密码',
        310: '两次输入的支付密码不一致',
        311: '请输入手机号',
        312: '请输入正确的手机号码，11位数字',
        313: '请输入邮箱',
        314: '请输入正确的邮箱',
        315: '请输入验证码',
        316: '请输入正确的验证码，6位数字',
        317: '验证码错误，请重新输入',
        318: '验证失败，请重新获取验证码',
        319: '您已设置过交易密码，请勿重复设置。',
        320: '找回支付密码失败，请重试',
        321: '新支付密码不能与原支付密码相同',
        322: '支付密码错误，请重新输入',
        323: '删除银行卡失败',
        324: '网络不给力啊',
        325: '支付密码请输入6位数字',
        326: '验证失败，请重新输入原手机',
        327: '修改安全验证手机失败，请重试',
        328: '绑定安全验证手机失败，请重试',
        329: '请正确输入银行卡号',
        330: '网络连接超时，请稍后重试',
        331: '请输入银行卡号',
        332: '请填写持卡人姓名',
        333: '请填写证件号',
        334: '请填写提现金额',
        335: '请勿超出可提现金额',
        336: '须确认该卡为本人持有',
        337: '请填写正确的证件号',
        338: '已超出当日提现限额',
        339: '请填写正确的提现金额',
        340: '单笔充值金额最高100万元',
        341: '请填写充值金额',
        342: '请填写正确的充值金额',
        343: '<div class="paytips">转出到现金余额<br/>. 转出即时到账<br/>. 可用于消费付款或提现至银行卡</div>',
        344: '请填写提现金额',
        345: '请填写正确的提现金额',
        346: '请勿超出可提现金额',
        347: '系统异常，开通失败，请稍后再试。',
        348: '系统异常，关闭失败，请稍后再试。',
        349: '请填写正确的转出金额',
        350: '请勿超过可转出金额',
        351: '每次最高转账额度是1000元',
        352: '根据国家法律规定，第一代居民身份证自2013年1月1日起停止使用。请填写您的18位身份证号码。',
        353: '请输入持卡人姓名',
        354: '请输入证件号码',
        355: '请输入正确的证件号码',
        356: '仅支持转出到储蓄卡',
        357: '仅支持输入整数',
        358: '请填写转出金额',
        359: '仅支持提现至储蓄卡',
        360: '请输入卡有效期',
        361: '请输入正确的卡有效期',
        362: '请输入卡验证码',
        363: '请输入正确的卡验证码，签名栏末尾3位数字',
        364: '设置成功',
        365: '网络系统异常，设置失败',
        366: '添加银行卡成功',
        367: '补全银行卡信息成功',
        368: '支付密码格式不正确',
        369: '支付密码过于简单，不能使用重复数字或连续数字',
        370: '仅支持信用卡',
        371: '请先填写卡信息',
        372: '请先进行实名认证',
        373: '卡信息错误，请核对并修改',
        374: '成功设置账号支付密码和手机',
        375: '输入金额，仅支持整数',
        376: '须确认该卡是本人持有',
        377:'请输入真实姓名',
        378:'您的钱包账户被冻结，如有疑问请联系携程客服。',
        379:'身份信息错误，请核对后重新修改',
        380:'您还未设置支付密码，为保护账户安全，请先设置支付密码！',
        381:'请输入生日'
    };
    var R = {
        get: function (code) {
            if (MESSAGE[code]) {
                return MESSAGE[code];
            } else {
                return MESSAGE[300];
            }
            
        }
    };
    return R;
});

